{
  "title": "Ritualistic Transmutation",
  "author": "Archmage Tervosh",
  "polymer_item": "minecraft:shaper_armor_trim_smithing_template",
  "pages": [
    {
      "type": "rites:chapter",
      "title": "Introduction",
      "paragraphs": [
        "This book is a beginner's guide to the art of transmutation, as commissioned by the Epicentral University of Magic. It's not meant to be a complete manual but rather a starting point for students looking to grasp its basics."
      ]
    },
    [
      "It is highly recommended that you read this book in full before attempting any of the magics contained within."
    ],
    {
      "type": "rites:chapter",
      "title": "General Concepts",
      "paragraphs": [
        "To perform any kind of transmutation, one must first be able to convert physical matter to a more malleable form. This is usually achieved using a Rite of Shifting Strands."
      ]
    },
    [
      "This rite will convert any arbitrary stack of items into their ritualistic representation, allowing further rites performed on the same core to act upon them.",
      "Only one such stack can be held by a Ritual Core at any given time, and attempts to perform the rite multiple times will not be successful."
    ],
    [
      "After performing a Rite of Shifting Strands, the ritual circle will enter a stable state to hold the provided stack indefinitely. While in this state, it is possible to perform another rite on the same core to apply a transformation to the stack.",
      "It merits to be noted that after one such transformation is applied, the stable state"
    ],
    [
      "will unravel and the stack will be converted back to its physical form. This will also happen if the ritual core is disrupted by other means."
    ],
    {
      "type": "rites:ritual_details",
      "ritual": "rites:io/accept_item_single",
      "title": "Rite of Shifting Strands",
      "indent": 1
    },
    {
      "type": "rites:ritual",
      "ritual": "rites:io/accept_item_single",
      "title": "Circle Layout"
    },
    {
      "type": "rites:chapter",
      "title": "Basic Alterations",
      "paragraphs": [
        "The most basic transmutation is the conversion of one item type into another. This chapter contains a few notable examples of such transmutations.",
        "Keep in mind that a larger ritual circle of the same color can always be used in"
      ]
    },
    [
      "place of the one shown, making it possible to combine any of the rites illustrated in this book with the Rite of Shifting Strands, even if it may not appear so at first glance."
    ],
    {
      "type": "rites:chapter",
      "title": "Iron to Gold",
      "indent": 1,
      "paragraphs": [
        "Let us begin with a classic; the creation of gold. Classically, this would be attempted using lead as a base, but a common method using iron is covered here instead, as it is more readily available."
      ]
    },
    [
      "The ritual on the following page will convert any object made of iron into its golden equivalent, given it exists.",
      "The amount of iron that can be converted in one attempt has proven to be limitless, so long as it can be contained within a single stack."
    ],
    {
      "type": "rites:ritual_details",
      "ritual": "rites:change/iron_to_gold",
      "title": "Rite of Classical Transmutation",
      "indent": 2,
      "lines": 2
    },
    {
      "type": "rites:ritual",
      "ritual": "rites:change/iron_to_gold",
      "title": "Circle Layout"
    },
    {
      "type": "rites:chapter",
      "title": "Other Metallurgy",
      "indent": 1,
      "paragraphs": [
        ""
      ]
    },
    [
      "TODO"
    ],
    {
      "type": "rites:ritual_details",
      "ritual": "rites:change/smelt",
      "title": "Rite of the Artificial Furnace",
      "indent": 2,
      "lines": 2
    },
    {
      "type": "rites:ritual",
      "ritual": "rites:change/smelt",
      "title": "Circle Layout"
    },
    [
      "TODO"
    ],
    {
      "type": "rites:ritual_details",
      "ritual": "rites:change/smelt",
      "title": "Rite of the Artificial Furnace",
      "indent": 2,
      "lines": 2
    },
    {
      "type": "rites:ritual",
      "ritual": "rites:change/smelt",
      "title": "Circle Layout"
    }
  ]
}